/* eslint-disable @typescript-eslint/no-loss-of-precision */
const restaurants = [
  {
    "RestaurantID": "C3_315081100H_000434",
    "RestaurantName": "生活文創館",
    "Description": "紀念品。",
    "Address": "南投縣553水里鄉車埕村民權巷110-2號",
    "ZipCode": "553",
    "Phone": "886-4-92871791",
    "OpenTime": "詳見官網或電話洽詢",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/554/640x480",
      "PictureDescription1": "生活文創館"
    },
    "Position": {
      "PositionLon": 120.86579895019531,
      "PositionLat": 23.833480834960938,
      "GeoHash": "wsjzw6gb1"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000435",
    "RestaurantName": "日月星舞民宿咖啡莊園",
    "Description": "從素人到職人的淬鍊    「日月星舞民宿」的主人退休後一時興起，在自家農場上種了幾分地的Arabica自己品嘗，還取了「悠哉咖啡場」的悠閒名字，無心插「啡」卻在田裡長出了美麗的紅寶石。目前民宿由年輕的第二代經營，而且他們自製的咖啡還榮獲了『2015年首屆日月潭精品咖啡評鑑大賽第一名「特等獎」』及『2015台灣咖啡烘焙競賽全國第三名』等佳績。    現在行政院環保署為提昇全民於住宿旅館時落實環保，力行綠色生活，「日月星舞民宿也希望為地球盡一份心力，只要旅客續住第二晚而不更換床單、浴巾，就可以享有每房折價200元並贈送日月星舞民宿精選日月潭紅茶乙盒(價值200元)。使用綠行動優惠方案，請於訂房時事先告知，讓民宿老闆為您作最好的準備他用15年的時間，煮出一杯感動全台灣的咖啡！    「日月星舞民宿咖啡莊園」的老闆－沈詠為說，從種植咖啡至今已有15年的經驗，選對好的品種相當重要...",
    "Address": "南投縣555魚池鄉大林村永川巷12-8號",
    "ZipCode": "555",
    "Phone": "886-4-92899347",
    "OpenTime": "24小時營業",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/1457/640x480",
      "PictureDescription1": "日月星舞外觀"
    },
    "Position": {
      "PositionLon": 120.94400787353516,
      "PositionLat": 23.882469177246094,
      "GeoHash": "wsnpb5str"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000437",
    "RestaurantName": "兩薑總督",
    "Description": "老薑精油、洗髮精、沐浴乳。",
    "Address": "南投縣553水里鄉車埕村民權巷110-2號",
    "ZipCode": "553",
    "Phone": "886-9-26127756",
    "OpenTime": "詳見官網或電話洽詢",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/587/640x480",
      "PictureDescription1": "兩薑總督"
    },
    "Position": {
      "PositionLon": 120.86579895019531,
      "PositionLat": 23.833480834960938,
      "GeoHash": "wsjzw6gb1"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000541",
    "RestaurantName": "敲敲木工房",
    "Description": "源起於1969年，早期因埔里伐木產業，造就了超過450家大大小小木工廠，「海山手工藝社」在施家三兄弟下因此誕生，生產大量聖誕飾品，如聖誕金字塔、薰香木偶等外銷產品，但特別的是，海山手工藝社是少數生產「胡桃鉗」和「音樂盒」的木工廠，於是於2012年以音樂盒的型態，轉型成可讓遊客體驗的木工房繼承過去木工的製造經驗，從傳統代工，轉型成自有品牌的設計、生產和行銷，並利用工廠的閒置空間，推廣過去埔里的木工文化，並發揚過去工藝師的價值，而第二代經營方向之一，是將過去所認為的DIY產品，更為精緻化、客製化，進而轉換成為可贈送的節日禮物，送給在心中極為重要的她/他，一種自我完成而無法取代的心意，讓簡單的材料都能變成生活的美好希望你能享受敲敲木的產品，並在您重要節日時帶給你的回憶這樣值得我們繼續努力下去。",
    "Address": "南投縣545埔里鎮大同街37號",
    "ZipCode": "545",
    "Phone": "886-4-92917803",
    "OpenTime": "● 星期二、三固定公休● 假日：六日，連續假日、國定假日正常營業。● 春節營業時間  請查閱 臉書 或 最新消息。● 營業時間：9:30-16:30",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/2983/640x480",
      "PictureDescription1": "敲敲木工房展示區"
    },
    "Position": {
      "PositionLon": 120.95733642578125,
      "PositionLat": 23.97500991821289,
      "GeoHash": "wsq02kw2w"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000542",
    "RestaurantName": "宗饌行",
    "Description": "南投在地製作 紅麴、醬油 、豆腐乳 製作，販售 推廣。",
    "Address": "南投縣553水里鄉車埕村民權巷110-2號",
    "ZipCode": "553",
    "Phone": "886-9-72870809",
    "OpenTime": "詳見官網或電話洽詢",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/3003/640x480",
      "PictureDescription1": "宗饌行"
    },
    "Position": {
      "PositionLon": 120.86588287353516,
      "PositionLat": 23.833770751953125,
      "GeoHash": "wsjzw6gcg"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000545",
    "RestaurantName": "造紙龍手創館",
    "Description": "​       用心做好每一張紙是「埔里造紙」自1979年成立迄今的經營理念，在創辦人張慶祥先生的帶領下，走過40年的歲月，如今已將優越的造紙技術，行銷至世界5大洲共60多個國家。2007年時，由經濟部工研院輔導成立「造紙龍手創館」，是屬於介紹機械造紙型態的觀光工廠，過去大家所知悉的傳統造紙，而造紙龍所呈現的是更富有現代化、生活化的機械紙張，透過故事導覽和DIY手作，向到訪的旅客傳遞紙的溫度。        造紙龍手創館坐落在南投埔里，一個始於清朝的造紙小鎮，熬過一段艱辛、競爭激烈的環境歷程後，將傳統紙廠轉型成觀光工廠。造紙龍運用自己工廠生產的〝彩浪紙〞研發製作成〝紙樂高立體公仔〞深受大小朋友喜愛，本館除了讓您享受DIY手作的樂趣之外，展覽館裡更呈獻許多紙藝的設計與創作。來到這兒您會發現，紙不再是簡單的一張紙而已，它更有著不同的樣貌，展現在我們豐富的生活美學當中~   ...",
    "Address": "南投縣545埔里鎮溪南里隆生路118-2號",
    "ZipCode": "545",
    "Phone": "886-4-92902989",
    "OpenTime": "09:00~17:00，紙樂高體驗工坊09:00~16:30(個人入園，隨到隨做)公休日：每週三及除夕當日公休*連續假期及春節假期照常營業",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/3026/640x480",
      "PictureDescription1": "造紙龍手創館"
    },
    "Position": {
      "PositionLon": 120.95841217041016,
      "PositionLat": 23.947799682617188,
      "GeoHash": "wsq00rx4p"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000546",
    "RestaurantName": "桃米有水居創意餐坊",
    "Description": "餐廳開業至今很多客人問腦闆說～為什麼你的餐廳都是青蛙是因為你很愛青蛙很喜歡青蛙嗎??其實不是但其實也是 ...腦闆出生於桃米坑，從小就生活在充滿各式各樣的青蛙中聽著蛙叫聲長大，然而現在有能力在自己的家鄉開餐廳，因此想藉由餐廳來拉近與客人的互動也展現了對家鄉的熱愛與關懷。讓大家更多了解桃米生態也讓小朋友們更親近青蛙。在桃米，你可以與台灣三分之二的蛙類相遇；在桃米，你可以與台灣三分之一的蜻蛉類、鳥類相逢；依山傍水的桃米里，面積不到全台的兩千分之一，但豐富的生態資源，連兩、三個鄉鎮也抵不上桃米里中的生態環境，原來桃米里中蘊藏著如此豐富的動植物生態，包含十九種的青蛙、四十三種的蜻蜓與豆娘、六十餘種的鳥類。桃米社區絕對是您夏季輕旅行消暑的好選擇可以探訪林頭坑林蔭小徑，置身蒼翠樹林間還有蜻蜓相伴，有空來一場自然生態觀察之旅吧。也別忘了來有水居創意餐坊吃頓鄉土道地美食喔！",
    "Address": "南投縣545埔里鎮桃米里桃米巷31-6號 (桃米親水公園旁)",
    "ZipCode": "545",
    "Phone": "886-4-92914107",
    "OpenTime": "上午11:00-14:00 晚上17:00-20:00每周三固定公休(除遇國定假日或連續假日)",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/3040/640x480",
      "PictureDescription1": "餐廳內部十分寬敞且簡潔明亮"
    },
    "Position": {
      "PositionLon": 120.9330062866211,
      "PositionLat": 23.943479537963867,
      "GeoHash": "wsmbpyu8z"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000559",
    "RestaurantName": "日月潭茶莊",
    "Description": "❤主要販售產品❤◆日月潭紅茶阿薩姆紅茶台茶18號(紅玉)台茶21號(紅韻)蜜香紅茶◆高山茶◆高山烏龍茶◆小米酒☎聯絡我們☎【聯絡方式 Tel / Line】：0937880146【聯絡方式 WeChat】： A0937880146【地址】：南投縣魚池鄉日月村德化街24號歡迎來日月潭伊達邵找我們品好茶☕現在支付方式越來越多，我們也要跟上時代腳步✅現金✅信用卡 （VISA/Mastercard/JCB/銀聯卡）✅國民旅遊卡✅台灣pay✅Line pay✅街口支付✅微信支付✅支付寶",
    "Address": "南投縣555魚池鄉日月村德化街24號",
    "ZipCode": "555",
    "Phone": "886-9-37880146",
    "OpenTime": "每日 10:00 ~ 19:00",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/3506/640x480",
      "PictureDescription1": "日月潭茶莊"
    },
    "Position": {
      "PositionLon": 120.8995132446289,
      "PositionLat": 23.85159683227539,
      "GeoHash": "wsjzxnh3d"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000560",
    "RestaurantName": "Jijibanana集元果觀光工廠",
    "Description": "要說集集的歷史，那麼，絕對得從「山蕉」談起。倚著得天獨厚的氣候與水土，集集山蕉特別美味，既香且甜、飽足水分又彈牙，獨具一番風味。台灣曾有香蕉王國的美譽，早期大量出口外銷香蕉到日本，其中中部山蕉就佔了相當重要的位置，集集山蕉曾滿足日本天皇挑剔的嘴，指定為御用貢品，籃子外頭寫著&rdquo;千&rdquo;字的，就是品質保證的集集山蕉。把集集山蕉的特色介紹給大家認識，來集集不只是坐小火車、看看山城風光，集集充滿著歷史故事，曾經輝煌一時的山蕉天堂。jijibanana集元果觀光工廠 分成三大主題區：戶外蕉園生態園區裏頭栽種103多種蕉種 包括可觀賞用以及食用蕉，下午的落日餘暉可以遠眺&quot;集集攔河堰&quot;，濁水溪向西流 配上蕉園的落日餘暉 真的好美喔!!生產製程大樓裏頭是集元果的大本部 好多美味食物都從這邊產出喔有蕉心巧克力、山蕉捲捲酥、山蕉果乾、金蕉條...等等...",
    "Address": "南投縣552集集鎮富山里大坪巷38號",
    "ZipCode": "552",
    "Phone": "886-4-92764562",
    "OpenTime": "週一至週日上午9:00 - 下午5:30週三公休",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/3132/640x480",
      "PictureDescription1": "Jijibanana集元果觀光工廠"
    },
    "Position": {
      "PositionLon": 120.81461334228516,
      "PositionLat": 23.82505989074707,
      "GeoHash": "wsjzt1nx0"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000563",
    "RestaurantName": "心栽茶【日月潭紅茶‧自然農法】",
    "Description": "心栽~為南投縣魚池鄉自產自銷的在地小農，「心栽」紅茶系列主要產品為日月潭在地紅茶。我們以有機自然農法，用心栽培好茶，採用最親近自然的無農藥及化學肥料栽作，尊重自然，以草生管理，以最少的干預讓作物與環境共生成長，雖然充滿了艱辛與挑戰，但只有讓土地回到最初的健康，才會孕育出充滿原味與自然的茶香。雖然無輝煌的歷史背景，但憑藉著一份回歸純自然的意念，回到初心，拾起那份來自內心深處的感動與熱情，堅持自己的理想。這份幸福，充滿原味與健康，辛勤，卻快樂知足！分享給每一位為夢想努力奮鬥的朋友。",
    "Address": "南投縣555魚池鄉東池村東興巷10~1號",
    "ZipCode": "555",
    "Phone": "886-9-32131728",
    "OpenTime": "詳見官網或電話洽詢",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/3230/640x480",
      "PictureDescription1": "花茶立體茶包"
    },
    "Position": {
      "PositionLon": 120.94275665283203,
      "PositionLat": 23.895780563354492,
      "GeoHash": "wsnpbn5g4"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000564",
    "RestaurantName": "日月潭青年活動中心",
    "Description": "本中心附設有中式餐廳，提供日月潭風味特色餐，森林庭園咖啡吧~青心園，提供香醇咖啡、品茗與套餐服務，讓遊客悠閒休憩，多重選擇。無論是觀光旅遊或是會議訓練，都能讓您沉浸在南投好山好水之餘，盡情在日月潭青年活動中心享受渡假的閒適氣氛。",
    "Address": "南投縣555魚池鄉日月村中正路101號",
    "ZipCode": "555",
    "Phone": "886-4-92850070",
    "OpenTime": "森林咖啡館/青心園:9:00-20:00中式餐廳:11:30-13:00；17:30-19:00",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/3166/640x480"
    },
    "Position": {
      "PositionLon": 120.9376220703125,
      "PositionLat": 23.8523006439209,
      "GeoHash": "wsnp8n0jd"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000566",
    "RestaurantName": "豐年靈芝菇類生態農場",
    "Description": "推展埔里休閒農業開放觀光體驗親手採到生鮮菇類的樂趣　豐年農場成立於民國55年，是一個歷史悠久、擁有多元化的產業，而且也是台灣食用菇類菌種涵蓋上、中、下游且有獨立的溫控栽培產業。食用菇類的製造是不對外開放、是神秘的，所以民眾食用到菇類，看到種植菇類，但一定無法全程看到菇類菌種的培養、製造過程。 　而我們想要做的就是要大家瞭解食用菇類菌種的製造、培養、生長的過程，以及看到從未聽過的菇類多元化品種，和食用菌對於生態環境功能與任務。也能體驗親手採到生鮮菇類的樂趣，更能夠讓遊客親手從原料到製造一瓶菇類菌種，看到菇菌類生命的過程到出菇管理等，推動豐年農場產業觀光，並讓農場產業版圖走向另一個領域。　豐年農場四十幾年來一直以食用菌種的製造與栽培為主，為菇菌業最上游之農場，也是生物科技公司的原料供應農場。主要栽培食藥用蕈類包括靈芝、巴西蘑菇、天山雪耳、血補珍菇、白精靈、猴頭菇等多種珍奇菇...",
    "Address": "南投縣545埔里鎮水頭里東潤路58號",
    "ZipCode": "545",
    "Phone": "886-4-92926959#27",
    "OpenTime": "開放時間：每日8:30-17:00(除夕公休)",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/3223/640x480",
      "PictureDescription1": "豐年靈芝菇類生態農場"
    },
    "Position": {
      "PositionLon": 120.98558807373047,
      "PositionLat": 23.943620681762695,
      "GeoHash": "wsq01ng18"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000567",
    "RestaurantName": "東益成商號-懷舊柑仔店",
    "Description": "西元1959年(民國48年)創辦人康萬生跟許安綿(現任店主阿綿阿嬤)開了「東益成商號」柑仔店(雜貨店)，販賣菸酒、茶米油鹽、鹹魚罐頭、日用百貨、糖果餅乾等等，比現在的便利商店賣得品想更多更雜。民國55-70年代是東益成商號的全盛期，那時候還是彰化客運的埔里總站，埔里地區要前往彰化鹿港都是在本店購票，人來人往生意頗好。雖然現代台灣人通常會去便利超商、全聯或大賣場買東西，但是總是少了一些人情味。人情味也是阿綿阿嬤仍堅守老店的最大動力，她喜歡跟年輕顧客聊天，她喜歡跟街坊鄰居噓寒問暖。走過60年「東益成商號」仍然是販賣人情味的地方！零食&伴手禮零售業      特色:      埔里唯一，60年歷史的懷舊柑仔店，一個有溫度的觀光案內所。      台灣唯一，以「東益成」為名的郵政代辦所，販賣台灣郵票&特色郵冊。      埔里車站唯一，文創紀念品展售中心，日月潭&埔里明信片。 ...",
    "Address": "南投縣545埔里鎮中正路370號",
    "ZipCode": "545",
    "Phone": "886-4-92982657",
    "OpenTime": "週一~週日 10:00~21:00",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/3224/640x480",
      "PictureDescription1": "東益成商號-懷舊柑仔店"
    },
    "Position": {
      "PositionLon": 120.96842956542969,
      "PositionLat": 23.964139938354492,
      "GeoHash": "wsq02dw90"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000579",
    "RestaurantName": "水社綜合商場",
    "Description": "水社綜合商場內有借問站提供旅客諮詢及行李寄存便利服務，也有美食餐廳、伴手禮商店，為旅客帶來多元服務性質之服務項目。提供服務項目：一、免費提供無線WiFi上網服務二、簡易觀光旅遊諮詢服務三、免費摺頁索取四、洗手間借用服務五、免費飲水六、免費3C產品充電服務七、自行車充氣借用服務八、外語諮詢服務，外語種類：中文、英文、台語。24H行李寄存便利服務小型寄物箱尺寸：高(42cm)*寬(42cm)*深(58cm)大型寄物箱尺寸：高(84cm)*寬(42cm)*深(52cm)",
    "Address": "南投縣555魚池鄉中山路163號",
    "ZipCode": "555",
    "Phone": "886-4-92856851",
    "OpenTime": "7-11及商場營業時間每日上午07：00至晚間20：00借問站服務時間平日 || 上午09：00至晚間5：00假日 || 上午09：00至晚間8：00",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/3454/640x480",
      "PictureDescription1": "水社綜合商場內部1樓設置借問站服務櫃台"
    },
    "Position": {
      "PositionLon": 120.91114044189453,
      "PositionLat": 23.8664608001709,
      "GeoHash": "wsjzz2ub1"
    },
    "Class": "其他",
    "ParkingInfo": "附近設有收費的中興停車場",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000580",
    "RestaurantName": "佑佑餐坊",
    "Description": "佑佑餐坊位於日月潭伊達邵碼頭結合地方不同特色食材，呈現出料理新風味^_^當地食材，特色風味，平價消費！",
    "Address": "南投縣555魚池鄉日月村義勇街124號",
    "ZipCode": "555",
    "Phone": "886-9-79345981",
    "OpenTime": "11:00~20:00",
    "Picture": {},
    "Position": {
      "PositionLon": 120.9300537109375,
      "PositionLat": 23.848060607910156,
      "GeoHash": "wsjzxv6t4"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000585",
    "RestaurantName": "廖鄉長紅茶故事館",
    "Description": "廖鄉長紅茶 Liao Mayor Black Tea--醇厚馥郁 | 魚池紅茶--[魚池紅茶]位於南投縣的魚池鄉，其紅茶產業自日據時代開始發展。1925年，日本人從印度引進大葉種「阿薩姆紅茶」茶樹種子在魚池鄉一帶地區進行試種，由於魚池鄉日夜溫差夠大，晨昏多霧，再加上土壤質地為酸性磚紅土，各方面客觀地理條件與阿薩姆紅茶原種植產地極為相似，故結果頗為成功。而當時治理臺灣的臺灣總督府也因此於1936年在魚池設立了「魚池紅茶試驗支所」，做為專門引進、推廣阿薩姆種紅茶的研究中心。魚池鄉的紅茶產業發展基礎，就此奠定。[紅茶故事館]甫於2012年落成的「廖鄉長紅茶故事館」，有著一身充滿歐式古典雅致風情的外觀，然而建築內部卻是懷舊與現代感並列，處處令人充滿驚奇。 一走進紅茶故事館，現場立即有貼心的服務人員為您送上一杯溫度適中、香氣甘醇的魚池鄉日月潭特產紅茶，為您暖手也暖心。館內安排紅茶...",
    "Address": "南投縣555魚池鄉新城村通文巷6-31號",
    "ZipCode": "555",
    "Phone": "886-4-92896217",
    "OpenTime": "早上九點至下午六點（09:00-18:00）。",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/4177/640x480",
      "PictureDescription1": "廖鄉長紅茶故事館"
    },
    "Position": {
      "PositionLon": 120.92671966552734,
      "PositionLat": 23.905370712280273,
      "GeoHash": "wsjzzzb4u"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000586",
    "RestaurantName": "HOHOCHA喝喝茶丨台灣香日月潭紅茶廠",
    "Description": "臺灣香日月潭紅茶廠「Hohocha喝喝茶」坐落在距離日月潭約5公里的台21線上，一幢以深木質調打造的日式建築，在綠意盎然的山林中若隱若現，和撲鼻而來的茶香味，讓過路旅客駐足停留。主題館一樓為將生產線與參觀動線結合的「觀光茶廠」，不僅讓生產線透明化，每個機器更附有解說牌，詳細介紹製茶八大程序，讓大家更認識通過ISO22000生產認證及農糧署五星茶廠等認證的茶廠，一旁的手搖紅茶和紅茶蛋芳香四溢，提供旅客解嘴饞。沿著路線走到二樓，是以輕食與伴手禮為主的「商品販賣區」，室內可以從透明天井俯瞰製茶過程，⼾外則可以一邊品茶香味⼗足的義式冰淇淋，⼀邊感受被環山包圍，相當浪漫。還有&quot;獨家研發紅茶餅皮披薩&quot;，可報名參加披薩DIY體驗課程，體驗親自動手製作披薩的樂趣！三樓整層是以實木桌椅與圓玻璃燈打造禪風生活的「品茗體驗區」，在暖色調的空間品茶、揉茶、混茶、封茶、奉茶，...",
    "Address": "南投縣555魚池鄉魚池村魚池街443-36號",
    "ZipCode": "555",
    "Phone": "886-4-92895899",
    "OpenTime": "平日9:00~17:30假日9:00~18:00(含連續假日)(公休日於臉書粉絲專頁另公告）",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/4180/640x480",
      "PictureDescription1": "HOHOCHA喝喝茶丨台灣香日月潭紅茶廠"
    },
    "Position": {
      "PositionLon": 120.93379211425781,
      "PositionLat": 23.895999908447266,
      "GeoHash": "wsjzzyjk3"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000587",
    "RestaurantName": "經典大飯店思麻丹館",
    "Description": "穆斯林友好餐廳認證經典大飯店思麻丹館規劃設置獨立、專用的穆斯林廚房、廚具、食材單獨存放於專區及安心用餐空間，使用符合Halal規章認證的食材及料理方式提供餐，並通過中國回教協會「穆斯林友好餐廳」認證。",
    "Address": "南投縣540南投市福興巷8-8號",
    "ZipCode": "540",
    "Phone": "886-4-92899999",
    "OpenTime": "餐廳營業時間不同，請參考飯店官網",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/4181/640x480",
      "PictureDescription1": "經典大飯店思麻丹館"
    },
    "Position": {
      "PositionLon": 120.8995132446289,
      "PositionLat": 23.85159683227539,
      "GeoHash": "wsjzxnh3d"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000590",
    "RestaurantName": "果寶歡酵觀光工廠",
    "Description": "坐落於南投縣埔里鎮山區是全亞洲第一大的網室有機嘉寶果農場，面積達12公頃，主要是以埔里絕佳氣候與水質培育出的果中黑鑽石-嘉寶果，以生態平衡的共生方式進行培育。有機栽培保持園區內生態環境完整，隨時隨地觀察到豐富的昆蟲及動植物，知性、感性的體驗休閒最佳場所。「果寶歡酵觀光工廠」以有機酵素為主題，結合亞洲最大網室有機嘉寶果農場！讓遊客可預約採果、親自品嚐的美好滋味，館內設有豐富酵素知識的歡酵故事館，帶領遊客透過視覺、嗅覺瞭解發酵。樹葡萄又名嘉寶果，是早期從巴西引進的果樹，有別於一般常吃的葡萄，口感略像山竹。",
    "Address": "南投縣545埔里鎮珠格里下湳巷15號",
    "ZipCode": "545",
    "Phone": "886-4-92991207",
    "OpenTime": "上午9點至下午5點",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/4223/640x480",
      "PictureDescription1": "果寶歡酵為一棟橘色建物"
    },
    "Position": {
      "PositionLon": 120.9540786743164,
      "PositionLat": 23.94171905517578,
      "GeoHash": "wsq00qknd"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000591",
    "RestaurantName": "信義鄉農會-梅子夢工廠",
    "Description": "在梅子只做為外銷出口的原料時，便已投入產品加工研發的行列。秉持在地製造與健康天然的原則，結合學術研究單位共同研發各式梅產品。希望每一位顧客能吃得更加健康、安心。產品開發也承襲活潑歡樂的在地意象，將文化創意帶入農產業，期盼在美味開啟之時，更能感受到臺灣山居生活文化的快樂氛圍。",
    "Address": "南投縣556信義鄉明德村新開巷11號",
    "ZipCode": "556",
    "Phone": "886-4-92791949",
    "OpenTime": "周一至周日上午8點至下午5點",
    "Picture": {},
    "Position": {
      "PositionLon": 120.85675811767578,
      "PositionLat": 23.69445037841797,
      "GeoHash": "wsjyy1mnn"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000592",
    "RestaurantName": "膨鼠紅茶",
    "Description": "偶然看到松鼠停駐在野山的老山茶樹下，叨著茶籽，「膨鼠是很挑嘴的，牠們只愛挑好的茶籽」從小在茶園長大的邱女士這樣說著，於是尋著松鼠足跡，夫妻倆找到了野生的茶樹，開始發酵對紅茶的熱愛，並以此命名為「膨鼠紅茶」，隨時以跳躍之姿準備讓更多人看見膨鼠夫妻的堅持。膨鼠爸娓娓道著，在日據時代台灣的茶葉紅遍國外，在魚池埔里地區，約有1720公傾的茶樹，但隨著紅茶的沒落、人力的外流，大家也不再量產紅茶；膨鼠爸以前任職於改良場，總在感嘆著為何以前可以做出品質這麼好的茶，再者，埔里的天然環境、土壤、水質所培育茶樹的環境跟印度阿薩姆茶樹的生長環境相同，所以這個地區種出的茶樹非常優良，既然擁有這麼好的天然條件，卻不善加利用，實在枉費老天的疼惜，因此下定決定攢研製茶的技術，憑藉著在改良場的技術基礎以及對紅茶有著濃厚的情感，在不斷的改良及嚐試下，一步步使紅茶產業回到昔日光景。「這件事，不只是為了自己...",
    "Address": "南投縣555魚池鄉中明村文化巷2-6號",
    "ZipCode": "555",
    "Phone": "886-4-92897127",
    "OpenTime": "每日上午8:00至下午7:00",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/4238/640x480",
      "PictureDescription1": "膨鼠紅茶"
    },
    "Position": {
      "PositionLon": 120.8995132446289,
      "PositionLat": 23.85159683227539,
      "GeoHash": "wsjzxnh3d"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081100H_000594",
    "RestaurantName": "伊斯坦堡市集-日月潭門市",
    "Description": "伊斯坦堡好物市集 『讓生活，就是度假』 我們希望，讓每件用品都異常美麗，讓家也充滿度假悠閒精緻的氣息 來到這邊，你可以找到獨一無二的傢飾品和居家用品；令人驚豔又實用的禮物搞定讓人煩惱的生日、喬遷、節慶；也可以感受到滿滿的異國風情讓生活離壓力更遠，分分秒秒離度假更近 『生活，就是度假 Make it holiday! 』",
    "Address": "南投縣555魚池鄉日月村義勇街106號",
    "ZipCode": "555",
    "Phone": "886-9-05661983",
    "OpenTime": "週日到週四10:00AM-20:00PM週五和週六10:00AM-21:00PM無公休日",
    "Picture": {
      "PictureUrl1": "https://www.sunmoonlake.gov.tw/image/4252/640x480",
      "PictureDescription1": "伊斯坦堡市集-日月潭門市"
    },
    "Position": {
      "PositionLon": 120.93049621582031,
      "PositionLat": 23.8487606048584,
      "GeoHash": "wsjzxvdch"
    },
    "Class": "其他",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081200H_000111",
    "RestaurantName": "茶二指故事館",
    "Description": "台灣二指茶-一段製茶的冒險故事時光回到當年，茶老闆還是8歲懵懂的小男孩。受長輩熱愛泡茶的潛移默化的影響，茶老闆與茶開啟了一段漫長而驚奇的旅程。為創造出符合8歲孩童味蕾的濃度，茶老闆試著研究焙茶的方法，並著意於縮短焙茶的時程，但因不熟悉機器的操作，一個意外斷了左手中指和無名指；於是，剩下的8指讓茶老闆仍可如常的生活；奉獻給茶的二指，成了茶老闆畢生為製好茶而努力的印記。館內販售有機茶、露雨起司蛋糕、茶油麵線、珍珠奶茶、牛尻餅、啃手指鳳梨酥...的特色商品，週六、日可欣賞薩克斯風的演奏，還附設親子沙池區可讓大人小孩一同歡樂。 詳細門票相關資訊請至茶二指故事館網站查詢",
    "Address": "551南投縣名間鄉埔中巷32-1號",
    "Phone": "886-4-92583126",
    "OpenTime": "星期一-星期日上午09:30-下午05:30",
    "Picture": {
      "PictureUrl1": "https://www.trimt-nsa.gov.tw/Content/Uploads/StrollArea/Detail/a7dd640e-2a9a-4939-a2a4-d066c0291177_thumb.jpg",
      "PictureDescription1": "茶二指故事館"
    },
    "Position": {
      "PositionLon": 120.64383697509766,
      "PositionLat": 23.825441360473633,
      "GeoHash": "wsjz9361m"
    },
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081200H_000246",
    "RestaurantName": "森18休閒農場",
    "Description": "於104年取得交通部觀光局清真餐飲認證。 森18休閒農場座落於本處，園區4,000坪遍植尤加利樹森林，海拔400公尺眺望著八卦山脈旱灌水庫，全台獨一無二的特殊水利工程，有「名間香格里拉」與「小日月潭」之稱。 森18注重自然生態保育，以綠色環境經營為理念&mdash;「節能減碳．愛地球」。 森18致力於樂活概念的發展，強調生態、生命、環境及自然的休閒農場，農場有珍禽園區、苗木植栽區、有機蔬菜區、森林spa區。 主要服務項目為：生態環境教育導覽、DIY體驗活動、校外教學、苗木植栽販售、農特產品販售、香氛產品販售、餐飲服務。推出之餐飲以健康養生鍋、蔬食義大利麵為主，及自然農法栽種的無毒野菜，無論是在食材、調味、菜色方面都是最新鮮、最天然，不僅吃的美味，也食的健康又養生。 適合家庭、公司團體、會議聚餐、春酒尾牙、慶生喜宴、婚禮派對、戶外教學、DIY體驗、露營燒烤。",
    "Address": "551台灣南投縣名間鄉田仔巷16-8號",
    "Phone": "886-4-92273797",
    "OpenTime": "星期二 上午10:00-下午05:00",
    "WebsiteUrl": "http://www.forest18.com/",
    "Picture": {
      "PictureUrl1": "https://www.trimt-nsa.gov.tw/Content/Uploads/StrollArea/Detail/f5ec8134-6eff-427f-9004-7fc969e670d5_thumb.jpg",
      "PictureDescription1": "森18休閒農場"
    },
    "Position": {
      "PositionLon": 120.67518615722656,
      "PositionLat": 23.86493682861328,
      "GeoHash": "wsjzf02zr"
    },
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081200H_000248",
    "RestaurantName": "星月天空景觀餐廳",
    "Description": "位於南投市猴探井旁的星月天空景觀餐廳，是八卦山山脈最高處之餐廳，擁有180度超廣角視野之夜景，夕陽、美食、親子遊憩，讓人心情飛揚，站在南投，俯瞰西台灣，台中、彰化、雲林，盡收眼底！",
    "Address": "540南投縣南投市猴探井街146巷 200",
    "Phone": "886-4-92292999",
    "OpenTime": "星期一-星期五 下午04:15-上午12:00星期六-星期日 上午10:15-下午11:55",
    "Picture": {},
    "Position": {
      "PositionLon": 120.63008117675781,
      "PositionLat": 23.91090965270996,
      "GeoHash": "wsmb10b5h"
    },
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081200H_000252",
    "RestaurantName": "赤腳精靈",
    "Description": "很久很久以前，有一群精靈來到南投市八卦山脈猴探井，他們腳踩著肥沃紅土，種植南瓜、紅薯、鳳梨等，每個晨昏，他們腳踩紅土，夕陽拉長了身影，紅土染紅了雙腳，他們就是傳說中可愛的「赤腳精靈」&hellip;&hellip;在這 海拔488公尺的猴探井，不算高山也不在市區，可謂「不山不市」，但景觀秀麗、居民和善、農產豐富優質，2012仲夏「天空之橋」誕生後，各地遊客慕名上山而來，驚艷不已。&ldquo;赤腳精靈&rdquo; 用本地特產精心研發柴燒窯烤麵包等，風味獨特，口感絕佳，配一杯本地新星─冰滴『紅土咖啡』，堪稱一絕。我們用心挑選在地最天然的食材，在具古早味的南瓜造型柴燒石窯中烘焙,不添加糖、油、改良劑等，及用心慢工出細活的方式來發酵、烘焙麵包，讓每張挑剔的嘴都能得到滿足！",
    "Address": "540南投縣南投市八卦路1-1號",
    "Phone": "886-4-92233666",
    "OpenTime": "請參考Facebook粉絲專頁資訊",
    "Picture": {
      "PictureUrl1": "https://www.trimt-nsa.gov.tw/Content/Uploads/StrollArea/Detail/302fe702-a2f6-4a2f-a844-674fda8a243b_thumb.jpg",
      "PictureDescription1": "赤腳精靈"
    },
    "Position": {
      "PositionLon": 120.63483428955078,
      "PositionLat": 23.892805099487305,
      "GeoHash": "wsjzcje9e"
    },
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081200H_000257",
    "RestaurantName": "桂花森林",
    "Description": "桂花森林是世芳茶廠於六年前轉型做休閒，以桂花茶結合產品、餐飲吸引消費者，故主打桂花特色之中式餐飲。桂花清淡，入菜不易，調以甜點飲料味道較明顯。本餐廳簡餐位子可容納60位，樓上圓桌合菜可容納8~10桌，平時不公休，11:00過後提供午餐，晚餐及下午茶時間供餐不休息。桂花烏龍茶及桂花釀可在桂花樹下品飲，亦可帶回特色產品與親友分享。餐廳推薦菜色及價位：以下均為套餐桂花餐280元(含桂花油雞、桂花香腸、配菜3種、湯、甜點、飲料)桂花鮮蒸魚300元白酒乳酪火鍋250元、桂花牛腩盅280元。",
    "Address": "551台灣南投縣名間鄉名松路一段503巷13號",
    "Phone": "886-4-92583327",
    "OpenTime": "星期一-星期日 上午09:00-下午06:00 星期二公休",
    "Picture": {},
    "Position": {
      "PositionLon": 120.64771270751953,
      "PositionLat": 23.831052780151367,
      "GeoHash": "wsjz96kcz"
    },
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_315081200H_000259",
    "RestaurantName": "茶米香農場",
    "Description": "在松柏嶺得天獨厚的美麗風景裡，我們除了擁有廣大的腹地、寧靜自然的環境、一流的視野景觀外，更值得您品嚐我們所提供的豐富料理，包括採集來自山野珍饈佳餚、有機蔬菜、放山雞等精心設計各色中式合菜料理，另外，我們為了重視身心健康的您，特別精心調製了一系列養生料理，低卡、低熱量，卻營養豐富，自然香味撲鼻，不容您錯過！我們從事茶葉產業已經五代之久了，為了促進產業升級，以茶入菜更配合當地農特產，鳳梨、生薑、山藥、通天草，依據四季變化作適當的變化。",
    "Address": "551南投縣名間鄉松山村松嶺街237之1號",
    "Phone": "886-4-92580023",
    "OpenTime": "請參考商家網站資訊",
    "WebsiteUrl": "http://www.teafragrance.com.tw/",
    "Picture": {},
    "Position": {
      "PositionLon": 120.62910461425781,
      "PositionLat": 23.839426040649414,
      "GeoHash": "wsjz8gz6t"
    },
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_376480000A_000295",
    "RestaurantName": "明山大飯店",
    "Description": "溪頭明山大飯店青山餐廳為提供饕客們精緻又不斷創新的口感，自即日起將推出深受各方好評的嶟魚套餐及山產野菜料理，期望能為消費者帶來不同的味覺感受。  ＊  1.明山大飯店青山餐廳於每季定期推出時令套餐。  2.筵席部分請事前預定。  3.以上價格均須加一成服務費。",
    "Address": "南投縣鹿谷鄉內湖村興產路2-3號",
    "ZipCode": "558",
    "Phone": "886-49-2612121",
    "OpenTime": "'10:00~20:00'",
    "WebsiteUrl": "http://www.mingshan.com.tw",
    "Picture": {
      "PictureUrl1": "http://travel.nantou.gov.tw/manasystem/files/food/20120525174252_鮮筍烤方.gif",
      "PictureDescription1": "鮮筍烤方",
      "PictureUrl2": "http://travel.nantou.gov.tw/manasystem/files/food/20120525174252_拔絲地瓜.gif",
      "PictureDescription2": "拔絲地瓜",
      "PictureUrl3": "http://travel.nantou.gov.tw/manasystem/files/food/20120525174252_丁香山蘇.gif",
      "PictureDescription3": "丁香山蘇"
    },
    "Position": {
      "PositionLon": 120.7959213256836,
      "PositionLat": 23.674379348754883,
      "GeoHash": "wsjysvbck"
    },
    "Class": "中式美食",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  },
  {
    "RestaurantID": "C3_376480000A_000300",
    "RestaurantName": "至膳園餐廳",
    "Description": "至膳園餐廳是一古色古香庭園式建築的住質健康飲食餐廳。位於往溪頭的151縣道路旁，離溪頭僅15分鐘，去竹山交流道也僅20分鐘車程，而美麗的內湖國小就在附近，本餐廳有一道非常富有地方風味的「茶葉餐」，這是老闆的創意哦!而「竹筍大餐」則是一年四季依季節不同的竹筍來做的料理。",
    "Address": "南投縣鹿谷鄉內湖村興產路70-2號",
    "ZipCode": "558",
    "Phone": "886-49-2755846",
    "OpenTime": "'10:00~20:00'",
    "WebsiteUrl": "http://zsy.mmmtravel.com.tw",
    "Picture": {
      "PictureUrl1": "http://travel.nantou.gov.tw/manasystem/files/food/20120525174234_溪頭龍鬚菜炒筍絲.jpg",
      "PictureDescription1": "溪頭龍鬚菜炒筍絲",
      "PictureUrl2": "http://travel.nantou.gov.tw/manasystem/files/food/20120525174234_竹筒蝦.jpg",
      "PictureDescription2": "竹筒蝦",
      "PictureUrl3": "http://travel.nantou.gov.tw/manasystem/files/food/20120525174234_竹筍爌肉.jpg",
      "PictureDescription3": "竹筍爌肉"
    },
    "Position": {
      "PositionLon": 120.77739715576172,
      "PositionLat": 23.72327995300293,
      "GeoHash": "wsjyuqeqj"
    },
    "Class": "中式美食",
    "City": "南投縣",
    "SrcUpdateTime": "2022-11-07T01:53:05+08:00",
    "UpdateTime": "2022-11-07T03:04:46+08:00"
  }
];

export default restaurants;
